tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlockGgi2D/constant/region_fluid/LESProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      LESProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

LESModel              oneEqEddy;    // Smagorinsky, dynSmagorinsky, oneEqEddy, SpalartAllmarasDDES, SpalartAllmarasIDDES

delta                 smooth;

printCoeffs           on;

cubeRootVolCoeffs
{
    deltaCoeff        1;
}

dynSmagorinskyCoeffs
{
    filter            simple;    // laplace, anisotropic
}

smoothCoeffs
{
    delta             cubeRootVol;
    maxDeltaRatio     1.1;

    cubeRootVolCoeffs
    {
        deltaCoeff    1;
    }
}

// ************************************************************************* //