tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgsBlockGgi2D/system/region_dynamic/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        trackedSurface
        {
            type            directMappedPatch;
            sampleMode      nearestPatchFace;
            sampleRegion    region_fluid;
            samplePatch     trackedSurface;
            offset          (0 0 0);
        }
    }
}

// ************************************************************************* //
